#+TITLE: PoSt Parameters - 时空证明参数
#+HUGO_SECTION: algorithms/post
#+HUGO_BASE_DIR: ../../

This section describes parameters for Rational-PoSt, the Proof-of-Spacetime used in Filecoin.

本节描述了时空证明原理的参数，在Filecoin中使用的证明时空。

#+begin_src lisp :package orient.lang :exports none
(asdf:load-system :orient)
(in-package orient.lang)
#+end_src

#+RESULTS:
: #<PACKAGE "ORIENT.LANG">

#+begin_src lisp :package orient.lang :exports none
(defparameter *filecoin* (get-system "../../orient/filecoin.orient"))
(defparameter *input* (interface:get-json-relation-list "../../orient/params.json"))
(defparameter *multi-input* (interface:get-json-relation-list "../../orient/multi-params.json"))
#+end_src

#+RESULTS:
: *MULTI-INPUT*

#+begin_src lisp :package lang :exports results
  (let ((result-tuple (extract (ask *filecoin* '(post-challenge-blocks post-challenge-hours post-proving-period) *input*))))
    (org-present-tuple result-tuple *filecoin*))
#+end_src

#+RESULTS:
| Parameter             | Type   | Value | Description                                                                                                                                                                                    |
| POST-CHALLENGE-BLOCKS | BLOCKS |   480 | The time offset before which the actual work of generating the PoSt cannot be started. This is some delta before the end of the Proving Period, and as such less than a single Proving Period. |
| POST-CHALLENGE-HOURS  | HOURS  |     2 | PoSt challenge time (see POST_CHALLENGE_BLOCKS).                                                                                                                                               |
| POST-PROVING-PERIOD   | BLOCKS |  5760 | The time interval in which a PoSt has to be submitted                                                                                                                                          |


#+begin_export html
{{% notice todo %}}
**TODO**: The above values are tentative and need both backing from research as well as detailed reasoning why we picked them.

**TODO**:以上值是暂定的，需要研究的支持，以及我们选择它们的详细理由。
{{% /notice %}}
#+end_export
